#### Terraform Plan (staging) 📖`success`

<details><summary>Show Plan (staging)</summary>

```

terraform
[0m[1mdata.terraform_remote_state.foundation: Reading...[0m[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=677282655012][0m
[0m[1mdata.terraform_remote_state.foundation: Read complete after 0s[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_cloudwatch_log_group.rds[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "rds" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/rds/instance/astro-data-pipeline-staging-postgres/postgresql"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-rds-logs"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "03-database"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-rds-logs"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_db_instance.main[0m will be created
[0m  [32m+[0m[0m resource "aws_db_instance" "main" {
      [32m+[0m[0m address                               = (known after apply)
      [32m+[0m[0m allocated_storage                     = 20
      [32m+[0m[0m apply_immediately                     = false
      [32m+[0m[0m arn                                   = (known after apply)
      [32m+[0m[0m auto_minor_version_upgrade            = true
      [32m+[0m[0m availability_zone                     = (known after apply)
      [32m+[0m[0m backup_retention_period               = 1
      [32m+[0m[0m backup_target                         = (known after apply)
      [32m+[0m[0m backup_window                         = "03:00-04:00"
      [32m+[0m[0m ca_cert_identifier                    = (known after apply)
      [32m+[0m[0m character_set_name                    = (known after apply)
      [32m+[0m[0m copy_tags_to_snapshot                 = false
      [32m+[0m[0m database_insights_mode                = (known after apply)
      [32m+[0m[0m db_name                               = "astro_catalog"
      [32m+[0m[0m db_subnet_group_name                  = "astro-data-pipeline-staging-db-subnet-group"
      [32m+[0m[0m dedicated_log_volume                  = false
      [32m+[0m[0m delete_automated_backups              = true
      [32m+[0m[0m deletion_protection                   = false
      [32m+[0m[0m domain_fqdn                           = (known after apply)
      [32m+[0m[0m endpoint                              = (known after apply)
      [32m+[0m[0m engine                                = "postgres"
      [32m+[0m[0m engine_lifecycle_support              = (known after apply)
      [32m+[0m[0m engine_version                        = "15.13"
      [32m+[0m[0m engine_version_actual                 = (known after apply)
      [32m+[0m[0m hosted_zone_id                        = (known after apply)
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m identifier                            = "astro-data-pipeline-staging-postgres"
      [32m+[0m[0m identifier_prefix                     = (known after apply)
      [32m+[0m[0m instance_class                        = "db.t3.small"
      [32m+[0m[0m iops                                  = (known after apply)
      [32m+[0m[0m kms_key_id                            = (known after apply)
      [32m+[0m[0m latest_restorable_time                = (known after apply)
      [32m+[0m[0m license_model                         = (known after apply)
      [32m+[0m[0m listener_endpoint                     = (known after apply)
      [32m+[0m[0m maintenance_window                    = "sun:04:00-sun:05:00"
      [32m+[0m[0m master_user_secret                    = (known after apply)
      [32m+[0m[0m master_user_secret_kms_key_id         = (known after apply)
      [32m+[0m[0m max_allocated_storage                 = 100
      [32m+[0m[0m monitoring_interval                   = 0
      [32m+[0m[0m monitoring_role_arn                   = (known after apply)
      [32m+[0m[0m multi_az                              = false
      [32m+[0m[0m nchar_character_set_name              = (known after apply)
      [32m+[0m[0m network_type                          = (known after apply)
      [32m+[0m[0m option_group_name                     = (known after apply)
      [32m+[0m[0m parameter_group_name                  = "astro-data-pipeline-staging-postgres-params"
      [32m+[0m[0m password                              = (sensitive value)
      [32m+[0m[0m password_wo                           = (write-only attribute)
      [32m+[0m[0m performance_insights_enabled          = false
      [32m+[0m[0m performance_insights_kms_key_id       = (known after apply)
      [32m+[0m[0m performance_insights_retention_period = (known after apply)
      [32m+[0m[0m port                                  = (known after apply)
      [32m+[0m[0m publicly_accessible                   = false
      [32m+[0m[0m replica_mode                          = (known after apply)
      [32m+[0m[0m replicas                              = (known after apply)
      [32m+[0m[0m resource_id                           = (known after apply)
      [32m+[0m[0m skip_final_snapshot                   = true
      [32m+[0m[0m snapshot_identifier                   = (known after apply)
      [32m+[0m[0m status                                = (known after apply)
      [32m+[0m[0m storage_encrypted                     = true
      [32m+[0m[0m storage_throughput                    = (known after apply)
      [32m+[0m[0m storage_type                          = "gp3"
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-postgres"
        }
      [32m+[0m[0m tags_all                              = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "03-database"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-postgres"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m timezone                              = (known after apply)
      [32m+[0m[0m username                              = "astro_user"
      [32m+[0m[0m vpc_security_group_ids                = [
          [32m+[0m[0m "sg-09f8a3f3814e21e2a",
        ]
    }

[1m  # aws_db_parameter_group.postgres[0m will be created
[0m  [32m+[0m[0m resource "aws_db_parameter_group" "postgres" {
      [32m+[0m[0m arn          = (known after apply)
      [32m+[0m[0m description  = "Managed by Terraform"
      [32m+[0m[0m family       = "postgres15"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m name         = "astro-data-pipeline-staging-postgres-params"
      [32m+[0m[0m name_prefix  = (known after apply)
      [32m+[0m[0m skip_destroy = false
      [32m+[0m[0m tags         = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-postgres-params"
        }
      [32m+[0m[0m tags_all     = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "03-database"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-postgres-params"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }

      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "log_checkpoints"
          [32m+[0m[0m value        = "1"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "log_lock_waits"
          [32m+[0m[0m value        = "1"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "log_min_duration_statement"
          [32m+[0m[0m value        = "1000"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "log_statement"
          [32m+[0m[0m value        = "mod"
        }
      [32m+[0m[0m parameter {
          [32m+[0m[0m apply_method = "immediate"
          [32m+[0m[0m name         = "shared_preload_libraries"
          [32m+[0m[0m value        = "pg_stat_statements"
        }
    }

[1m  # aws_db_subnet_group.main[0m will be created
[0m  [32m+[0m[0m resource "aws_db_subnet_group" "main" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m description             = "Managed by Terraform"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m name                    = "astro-data-pipeline-staging-db-subnet-group"
      [32m+[0m[0m name_prefix             = (known after apply)
      [32m+[0m[0m subnet_ids              = [
          [32m+[0m[0m "subnet-03d4683860c48e4fc",
          [32m+[0m[0m "subnet-03fb834df4a321519",
        ]
      [32m+[0m[0m supported_network_types = (known after apply)
      [32m+[0m[0m tags                    = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-db-subnet-group"
        }
      [32m+[0m[0m tags_all                = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "03-database"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-db-subnet-group"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m vpc_id                  = (known after apply)
    }

[1m  # aws_secretsmanager_secret.rds_credentials[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret" "rds_credentials" {
      [32m+[0m[0m arn                            = (known after apply)
      [32m+[0m[0m description                    = "RDS credentials for astro-data-pipeline PostgreSQL database"
      [32m+[0m[0m force_overwrite_replica_secret = false
      [32m+[0m[0m id                             = (known after apply)
      [32m+[0m[0m name                           = (known after apply)
      [32m+[0m[0m name_prefix                    = (known after apply)
      [32m+[0m[0m policy                         = (known after apply)
      [32m+[0m[0m recovery_window_in_days        = 30
      [32m+[0m[0m tags                           = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-rds-credentials"
        }
      [32m+[0m[0m tags_all                       = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "03-database"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-rds-credentials"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }

      [32m+[0m[0m replica (known after apply)
    }

[1m  # aws_secretsmanager_secret_version.rds_credentials[0][0m will be created
[0m  [32m+[0m[0m resource "aws_secretsmanager_secret_version" "rds_credentials" {
      [32m+[0m[0m arn                  = (known after apply)
      [32m+[0m[0m has_secret_string_wo = (known after apply)
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m secret_id            = (known after apply)
      [32m+[0m[0m secret_string        = (sensitive value)
      [32m+[0m[0m secret_string_wo     = (write-only attribute)
      [32m+[0m[0m version_id           = (known after apply)
      [32m+[0m[0m version_stages       = (known after apply)
    }

[1m  # random_id.secret_suffix[0][0m will be created
[0m  [32m+[0m[0m resource "random_id" "secret_suffix" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 4
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m keepers     = {
          [32m+[0m[0m "rds_identifier" = "astro-data-pipeline-staging-postgres"
        }
    }

[1m  # random_password.rds_password[0m will be created
[0m  [32m+[0m[0m resource "random_password" "rds_password" {
      [32m+[0m[0m bcrypt_hash      = (sensitive value)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m keepers          = {
          [32m+[0m[0m "version" = "2"
        }
      [32m+[0m[0m length           = 16
      [32m+[0m[0m lower            = true
      [32m+[0m[0m min_lower        = 0
      [32m+[0m[0m min_numeric      = 0
      [32m+[0m[0m min_special      = 0
      [32m+[0m[0m min_upper        = 0
      [32m+[0m[0m number           = true
      [32m+[0m[0m numeric          = true
      [32m+[0m[0m override_special = "!#$%&*+-=?^_`{|}~"
      [32m+[0m[0m result           = (sensitive value)
      [32m+[0m[0m special          = true
      [32m+[0m[0m upper            = true
    }

[1mPlan:[0m 8 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m database_url                = (sensitive value)
  [32m+[0m[0m db_parameter_group_name     = "astro-data-pipeline-staging-postgres-params"
  [32m+[0m[0m db_subnet_group_arn         = (known after apply)
  [32m+[0m[0m db_subnet_group_name        = "astro-data-pipeline-staging-db-subnet-group"
  [32m+[0m[0m postgis_installation_guide  = (known after apply)
  [32m+[0m[0m rds_credentials_secret_arn  = (sensitive value)
  [32m+[0m[0m rds_credentials_secret_id   = (sensitive value)
  [32m+[0m[0m rds_credentials_secret_name = (known after apply)
  [32m+[0m[0m rds_database_name           = "astro_catalog"
  [32m+[0m[0m rds_endpoint                = (sensitive value)
  [32m+[0m[0m rds_instance_arn            = (known after apply)
  [32m+[0m[0m rds_instance_id             = (known after apply)
  [32m+[0m[0m rds_port                    = (known after apply)
  [32m+[0m[0m rds_username                = (sensitive value)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named
[33m│[0m [0m"enable_container_insights" but a value was found in file
[33m│[0m [0m"../staging.tfvars". If you meant to use this value, add a "variable" block
[33m│[0m [0mto the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "eks_node_groups" but a
[33m│[0m [0mvalue was found in file "../staging.tfvars". If you meant to use this
[33m│[0m [0mvalue, add a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValues for undeclared variables[0m
[33m│[0m [0m
[33m│[0m [0m[0mIn addition to the other similar warnings shown, 14 other variable(s)
[33m│[0m [0mdefined without being declared.
[33m╵[0m[0m

```

</details>

*Pushed by: @p27mcgee, Action: `pull_request`*